In [1]:
import math
import collections

import numpy as np
import pandas as pd
import matplotlib.pyplot as pp

%matplotlib inline

In [2]:
np.linspace(0,6,3)

array([0., 3., 6.])

In [2]:
pd.options.display.max_rows = 10

In [3]:
allyears24 = pd.read_csv('data/allyears.csv.gz')

In [4]:
xTotalCount = allyears24['number'].sum()
xTotalCount

np.int64(372009150)

In [12]:
xTotalCountByYear = allyears24.groupby(['year'])['number'].sum().reset_index()
xTotalCountByYear['number'] = xTotalCountByYear['number'].apply(lambda x: "{:,}".format(x))
xTotalCountByYear

     year     number
0    1880    201,484
1    1881    192,688
2    1882    221,533
3    1883    216,946
4    1884    243,461
..    ...        ...
140  2020  3,340,577
141  2021  3,387,949
142  2022  3,383,135
143  2023  3,311,196
144  2024  3,328,501

[145 rows x 2 columns]

In [8]:
xTotalCountByYearMax = allyears24.groupby(['year'])['number'].sum().reset_index()
# xTotalCountByYearMax['number'] = xTotalCountByYearMax['number'].apply(lambda x: "{:,}".format(x))
# xTotalCountByYearMax = xTotalCountByYearMax['number'].max()
xTotalCountByYearMax

     year   number
0    1880   201484
1    1881   192688
2    1882   221533
3    1883   216946
4    1884   243461
..    ...      ...
140  2020  3340577
141  2021  3387949
142  2022  3383135
143  2023  3311196
144  2024  3328501

[145 rows x 2 columns]

In [10]:
maxCount = xTotalCountByYearMax['number'].max()
maxCount

np.int64(4202143)

In [30]:
# # max_row_index = df['col2'].idxmax()
# # max_row = df.iloc[max_row_index]
# # xTotalCountByYear
# maxCount_row = xTotalCountByYear['number'].idxmax()
# maxCount = xTotalCountByYear.iloc[maxCount_row]
# maxCount

# # max_sum = grouped_sum.max()
# # print(max_sum)

max_sum = xTotalCountByYear['number'].max()
max_sum

'988,062'

In [19]:
# max_sum_rows = grouped_sum[grouped_sum == max_sum]
# print(max_sum_rows)

max_sum_rows = xTotalCountByYear[xTotalCountByYear == max_sum]
max_sum_rows

     year number
0     NaN    NaN
1     NaN    NaN
2     NaN    NaN
3     NaN    NaN
4     NaN    NaN
..    ...    ...
140   NaN    NaN
141   NaN    NaN
142   NaN    NaN
143   NaN    NaN
144   NaN    NaN

[145 rows x 2 columns]

In [20]:
data = {'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
        'Value': [10, 15, 20, 25, 30, 10]}
df = pd.DataFrame(data)

# Group by 'Category' and sum the 'Value'
grouped_sum = df.groupby('Category')['Value'].sum()

# Find the maximum sum
max_sum = grouped_sum.max()

# Filter for rows with the maximum sum
max_sum_rows = grouped_sum[grouped_sum == max_sum]

print("Grouped Sum:\n", grouped_sum)
print("\nMaximum Sum:", max_sum)
print("\nRows with Maximum Sum:\n", max_sum_rows)

Grouped Sum:
 Category
A    25
B    45
C    40
Name: Value, dtype: int64

Maximum Sum: 45

Rows with Maximum Sum:
 Category
B    45
Name: Value, dtype: int64

In [28]:
# maximum baby names by year
xTotalCountByYear_noIdxRst = allyears24.groupby(['year'])['number'].sum()
# xTotalCountByYear['number'] = xTotalCountByYear['number'].apply(lambda x: "{:,}".format(x))
max_row_data = xTotalCountByYear_noIdxRst[xTotalCountByYear_noIdxRst == xTotalCountByYear_noIdxRst.max()]
max_row_data = max_row_data.reset_index()
max_row_data['number'] = max_row_data['number'].apply(lambda x: "{:,}".format(x))
max_row_data

   year     number
0  1957  4,202,143

In [27]:
# mininum baby names by year
xTotalCountByYear_noIdxRst = allyears24.groupby(['year'])['number'].sum()
min_row_data = xTotalCountByYear_noIdxRst[xTotalCountByYear_noIdxRst == xTotalCountByYear_noIdxRst.min()]
min_row_data = min_row_data.reset_index()
min_row_data['number'] = min_row_data['number'].apply(lambda x: "{:,}".format(x))
min_row_data

   year   number
0  1881  192,688